Environmental Applications/AIJ - Case A/system/probesIQy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            (sampling);
writeControl    runTime;
writeInterval   0.001;

fields
(
    U
);

probeLocations
(
(	0.001	0.3	0.003	)
(	0.001	0.3	0.005	)
(	0.001	0.3	0.008	)
(	0.001	0.3	0.01	)
(	0.001	0.3	0.012	)
(	0.001	0.3	0.015	)
(	0.001	0.3	0.02	)
(	0.001	0.3	0.03	)
(	0.001	0.3	0.04	)
(	0.001	0.3	0.05	)
(	0.001	0.3	0.06	)
(	0.001	0.3	0.07	)
(	0.001	0.3	0.08	)
(	0.001	0.3	0.1	)
(	0.001	0.3	0.13	)
(	0.001	0.3	0.16	)
(	0.001	0.3	0.2	)
(	0.001	0.3	0.25	)
(	0.001	0.3	0.3	)
(	0.001	0.3	0.35	)
(	0.001	0.3	0.4	)
(	0.001	0.3	0.45	)
(	0.2	0.3	0.003	)
(	0.2	0.3	0.005	)
(	0.2	0.3	0.008	)
(	0.2	0.3	0.01	)
(	0.2	0.3	0.012	)
(	0.2	0.3	0.015	)
(	0.2	0.3	0.02	)
(	0.2	0.3	0.03	)
(	0.2	0.3	0.04	)
(	0.2	0.3	0.05	)
(	0.2	0.3	0.06	)
(	0.2	0.3	0.07	)
(	0.2	0.3	0.08	)
(	0.2	0.3	0.1	)
(	0.2	0.3	0.13	)
(	0.2	0.3	0.16	)
(	0.2	0.3	0.2	)
(	0.2	0.3	0.25	)
(	0.2	0.3	0.3	)
(	0.2	0.3	0.35	)
(	0.2	0.3	0.4	)
(	0.2	0.3	0.45	)
(	0.6	0.3	0.003	)
(	0.6	0.3	0.005	)
(	0.6	0.3	0.008	)
(	0.6	0.3	0.01	)
(	0.6	0.3	0.012	)
(	0.6	0.3	0.015	)
(	0.6	0.3	0.02	)
(	0.6	0.3	0.03	)
(	0.6	0.3	0.04	)
(	0.6	0.3	0.05	)
(	0.6	0.3	0.06	)
(	0.6	0.3	0.07	)
(	0.6	0.3	0.08	)
(	0.6	0.3	0.1	)
(	0.6	0.3	0.13	)
(	0.6	0.3	0.16	)
(	0.6	0.3	0.2	)
(	0.6	0.3	0.25	)
(	0.6	0.3	0.3	)
(	0.6	0.3	0.35	)
(	0.6	0.3	0.4	)
(	0.6	0.3	0.45	)
(	1.2	0.3	0.003	)
(	1.2	0.3	0.005	)
(	1.2	0.3	0.008	)
(	1.2	0.3	0.01	)
(	1.2	0.3	0.012	)
(	1.2	0.3	0.015	)
(	1.2	0.3	0.02	)
(	1.2	0.3	0.03	)
(	1.2	0.3	0.04	)
(	1.2	0.3	0.05	)
(	1.2	0.3	0.06	)
(	1.2	0.3	0.07	)
(	1.2	0.3	0.08	)
(	1.2	0.3	0.1	)
(	1.2	0.3	0.13	)
(	1.2	0.3	0.16	)
(	1.2	0.3	0.2	)
(	1.2	0.3	0.25	)
(	1.2	0.3	0.3	)
(	1.2	0.3	0.35	)
(	1.2	0.3	0.4	)
(	1.2	0.3	0.45	)
(	1.8	0.3	0.003	)
(	1.8	0.3	0.005	)
(	1.8	0.3	0.008	)
(	1.8	0.3	0.01	)
(	1.8	0.3	0.012	)
(	1.8	0.3	0.015	)
(	1.8	0.3	0.02	)
(	1.8	0.3	0.03	)
(	1.8	0.3	0.04	)
(	1.8	0.3	0.05	)
(	1.8	0.3	0.06	)
(	1.8	0.3	0.07	)
(	1.8	0.3	0.08	)
(	1.8	0.3	0.1	)
(	1.8	0.3	0.13	)
(	1.8	0.3	0.16	)
(	1.8	0.3	0.2	)
(	1.8	0.3	0.25	)
(	1.8	0.3	0.3	)
(	1.8	0.3	0.35	)
(	1.8	0.3	0.4	)
(	1.8	0.3	0.45	)

);

// ************************************************************************* //
